benchmark/artillery-config.yml
config:
  target: 'http://127.0.0.1:10000' # Target URL under test
  phases:
    - duration: 6
      arrivalRate: 6 # 6 new virtual users per second during warm-up
    - duration: 60
      arrivalRate: 60 # 60 new virtual users per second during the main phase
scenarios:
  - name: test_scenario
    flow:
      # Default locale — pages in the default CLI profile (index + page)
      - get:
          url: '/'
      - get:
          url: '/page'
      # Sample of non-default locales × pages (bounded; fixtures may have fewer locales)
      - get:
          url: '/ru'
      - get:
          url: '/de'
      - get:
          url: '/fr'
      - get:
          url: '/ru/page'
      - get:
          url: '/de/page'
      - get:
          url: '/fr/page'
    parallel-requests: 8
modules:
  console: # Enables console output during the test
    disable: false
reporting:
  - module: final-stats
  - module: json
    filename: results.json # Write test results as JSON