benchmark/artillery-config.yml
config:
  target: 'http://127.0.0.1:10000' # Target URL under test
  phases:
    - duration: 6
      arrivalRate: 6 # Peak number of users during the warm-up phase
    - duration: 60
      arrivalRate: 60 # Main test phase with 60 users
scenarios:
  - name: test_scenario
    flow:
      - get:
          url: '/' # Uses target from the config section
      - get:
          url: '/ru'
      - get:
          url: '/de'
      - get:
          url: '/page'
      - get:
          url: '/ru/page'
      - get:
          url: '/de/page'
    parallel-requests: 6 # Fire all requests concurrently
modules:
  console: # Enables console output during the test
    disable: false
reporting:
  - module: final-stats
  - module: json
    filename: results.json # Write test results as JSON